Revit 2027 API
DisplacementElement.CanElementsBeDisplaced(View, ICollection<ElementId>, ElementId) Method
 Indicates if elements can be assigned to a new DisplacementElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanElementsBeDisplaced(
	View view,
	ICollection<ElementId> elementIds,
	out ElementId commonDisplacedElementId
)
Public Shared Function CanElementsBeDisplaced (
	view As View,
	elementIds As ICollection(Of ElementId),
	<OutAttribute> ByRef commonDisplacedElementId As ElementId
) As Boolean
public:
static bool CanElementsBeDisplaced(
	View^ view,
	ICollection<ElementId^>^ elementIds,
	[OutAttribute] ElementId^% commonDisplacedElementId
)
static member CanElementsBeDisplaced :
        view : View *
        elementIds : ICollection<ElementId> *
        commonDisplacedElementId : ElementId byref -> bool
Parameters
view View
 The view.
elementIds ICollection<ElementId>
 The element ids.
commonDisplacedElementId ElementId
 If this method returns true, then this is the element id of a DisplacementElement which lists all of elemIds among its displaced elements.
Return Value
Boolean
 Returns true if the specified element ids can be assigned to a new DisplacementElement.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 A necessary condition is that isAllowedAsDisplacedElement returns true for each individual element id. In addition, if isElementDisplaced must return the same value for all the specified element ids.
See Also
Reference
DisplacementElement Class
CanElementsBeDisplaced Overload
Autodesk.Revit.DB Namespace